mooc-ui/SDK15.3-test-in-NRF52840-/examples/ble_peripheral/ble_app_hrs_freertos/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type               = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance      = true;
    init.advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
    init.advdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.advdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;//广播间隔
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;//广播超时停止代码

    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for starting advertising. */
static void advertising_start(void * p_erase_bonds)
{
    bool erase_bonds = *(bool*)p_erase_bonds;

    if (erase_bonds)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        ret_code_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
        APP_ERROR_CHECK(err_code);
    }
}


#if NRF_LOG_ENABLED
/**@brief Thread for handling the logger.
 *
 * @details This thread is responsible for processing log entries if logs are deferred.
 *          Thread flushes all log entries and suspends. It is resumed by idle task hook.
 *
 * @param[in]   arg   Pointer used for passing some arbitrary information (context) from the
 *                    osThreadCreate() call to the thread.
 */
static void logger_thread(void * arg)
{
    UNUSED_PARAMETER(arg);

    while (1)
    {
        NRF_LOG_FLUSH();

        vTaskSuspend(NULL); // Suspend myself
    }
}
#endif //NRF_LOG_ENABLED

/**@brief A function which is hooked to idle task.
 * @note Idle hook must be enabled in FreeRTOS configuration (configUSE_IDLE_HOOK).
 */
void vApplicationIdleHook( void )
{
#if NRF_LOG_ENABLED
     vTaskResume(m_logger_thread);
#endif
}


/**@brief Function for initializing the clock.
 */
static void clock_init(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
}


static void task1(void * p_context){
    while(1){
        bsp_board_led_on(BSP_BOARD_LED_2);
        vTaskDelay(1000);
        bsp_board_led_off(BSP_BOARD_LED_2);
        vTaskDelay(1000);
              
        //NRF_LOG_INFO("i'm task1");
        //pass
    }
}



static void task2(void *p_context){
    
    while(1){
        bsp_board_led_on(BSP_BOARD_LED_3);
        vTaskDelay(1000);
        bsp_board_led_off(BSP_BOARD_LED_3);
        vTaskDelay(1000);
        //NRF_LOG_INFO("i'm task2");
        //pass
    }
}


/*
等待接收事件标志
如果 xClearOnExit 设置为 pdTRUE，那么在 xEventGroupWaitBits()返回之前
如果满足等待条件（如果函数返回的原因不是超时），那么在事件组中设置
的 uxBitsToWaitFor 中的任何位都将被清除。
如果 xClearOnExit 设置为 pdFALSE，
则在调用 xEventGroupWaitBits()时，不会更改事件组中设置的位。

xWaitForAllBits 如果 xWaitForAllBits 设置为 pdTRUE，则当 uxBitsToWaitFor 中
的所有位都设置或指定的块时间到期时， xEventGroupWaitBits()才返回。
如果 xWaitForAllBits 设置为 pdFALSE，则当设置 uxBitsToWaitFor 中设置的任何
一个位置 1 或指定的块时间到期时， xEventGroupWaitBits()都会返回。
阻塞时间由 xTicksToWait 参数指定。
*/
static void receive_task(void *p_context){
    EventBits_t r_event;//定义一个事件接受变量
    while(1){
		r_event = xEventGroupWaitBits(
					Event_Handle,	// The event group being tested.
					BIT_0 | BIT_4,	// The bits within the event group to wait for.
					pdTRUE,			// BIT_0 and BIT_4 should be cleared before returning.
					pdFALSE,		// Don't wait for both bits, either bit will do.
					portMAX_DELAY );	// Wait a maximum of 100ms for either bit to be set.

		if( ( r_event & ( BIT_0 | BIT_4 ) ) == ( BIT_0 | BIT_4 ) )
		{
            bsp_board_led_invert(BSP_BOARD_LED_1);
            NRF_LOG_INFO("event0 or event4 happend");
			// xEventGroupWaitBits() returned because both bits were set.
		}
		else if( ( r_event & BIT_0 ) != 0 )
		{
            NRF_LOG_INFO("event0 happend");
			// xEventGroupWaitBits() returned because just BIT_0 was set.
		}
		else if( ( r_event & BIT_4 ) != 0 )
		{
            NRF_LOG_INFO("event4 happend");
			// xEventGroupWaitBits() returned because just BIT_4 was set.
		}
		else
		{
			// xEventGroupWaitBits() returned because xTicksToWait ticks passed
			// without either BIT_0 or BIT_4 becoming set.
		}
        vTaskDelay(20);
    }
    
}


static void send_task(void *p_context){
    while(1){
        if(m_key1_press){
            NRF_LOG_INFO("send task detect key1 press");
            m_key1_press = 0;
            bsp_board_led_invert(BSP_BOARD_LED_1);
            xEventGroupSetBits(Event_Handle, BIT_0);//触发事件0
        }
        if(m_key2_press){
            m_key2_press = 0;
            xEventGroupSetBits(Event_Handle, BIT_4);//触发事件4
        }//这个延时的位置不要弄错了;他是在while(1)里面
        vTaskDelay(20);//没20ms扫描一次,这个延时很重要，没有它将不会打印log
    }  
}


/*
任务的几种状态:
           挂起状态
         *         *
        /  \         \
            *
      就绪态 <-->  运行状态
         *
          \       /
                 *
           阻塞状态

*/

